# Building a pandas dataset, doing the math operations & Importing CSV

In today's excerise, I will be building a pandas dataframes using both numpy and pandas series. Then at the end of this excercise,  will be exporting a csv

In [1]:
# Imports
import numpy as np
import pandas as pd

In [2]:
# Building the dataframe series
s1 = pd.Series([12000, 34000, 69000, 45000, 12300, 15000, 43000, 62000])

dict = {'Names': ['ashley', 'Mucheru', 'Allan', 'Alex', 'Yusuf', 'wendy', 'John', 'Mutheu'],
       'Position': ['Managing Director', 'Secretary', 'IT Personel', 'HR Officer', 'Personal Assistant', 'Sales Agent', 'Supervisor', 'Recruiter'],
       'salary': s1}

In [3]:
df = pd.DataFrame(dict)
df

     Names            Position  salary
0   ashley   Managing Director   12000
1  Mucheru           Secretary   34000
2    Allan         IT Personel   69000
3     Alex          HR Officer   45000
4    Yusuf  Personal Assistant   12300
5    wendy         Sales Agent   15000
6     John          Supervisor   43000
7   Mutheu           Recruiter   62000

In [4]:
df.head()

     Names            Position  salary
0   ashley   Managing Director   12000
1  Mucheru           Secretary   34000
2    Allan         IT Personel   69000
3     Alex          HR Officer   45000
4    Yusuf  Personal Assistant   12300

In [5]:
df.shape

(8, 3)

In [6]:
df.tail()

    Names            Position  salary
3    Alex          HR Officer   45000
4   Yusuf  Personal Assistant   12300
5   wendy         Sales Agent   15000
6    John          Supervisor   43000
7  Mutheu           Recruiter   62000

In [7]:
df.columns

Index(['Names', 'Position', 'salary'], dtype='object')

In [8]:
df.info

<bound method DataFrame.info of      Names            Position  salary
0   ashley   Managing Director   12000
1  Mucheru           Secretary   34000
2    Allan         IT Personel   69000
3     Alex          HR Officer   45000
4    Yusuf  Personal Assistant   12300
5    wendy         Sales Agent   15000
6     John          Supervisor   43000
7   Mutheu           Recruiter   62000>

In [9]:
df.sum()

Names              ashleyMucheruAllanAlexYusufwendyJohnMutheu
Position    Managing DirectorSecretaryIT PersonelHR Office...
salary                                                 292300
dtype: object

In [10]:
# adding new columns
s2 = ['single', 'married', 'single', 'divorced', 'single', 'dicorced', 'married', 'married']
df['Marital_status']=s2

In [11]:
df

     Names            Position  salary Marital_status
0   ashley   Managing Director   12000         single
1  Mucheru           Secretary   34000        married
2    Allan         IT Personel   69000         single
3     Alex          HR Officer   45000       divorced
4    Yusuf  Personal Assistant   12300         single
5    wendy         Sales Agent   15000       dicorced
6     John          Supervisor   43000        married
7   Mutheu           Recruiter   62000        married

In [12]:
df.to_csv('Details.csv')